'use client';

import type { FC } from 'react';
import React, { useState } from 'react';

import Accordion from '@/components/Accordion';
import { cn } from '@/libs/cn';

const mockFreqQuestions = [
  {
    id: 1,
    title: 'Що таке АВА-терапія?',
    content:
      'АВА-терапія, або прикладний аналіз поведінки (Applied Behavioral Analysis), є одним із провідних методів корекції поведінки, особливо для дітей з розладами аутистичного спектра (РАС). Ця методика фокусується на зміні поведінки через позитивне підкріплення, що дозволяє дітям навчатися адаптивним навичкам та зменшувати небажану поведінку.',
  },
  {
    id: 2,
    title:
      'Як раннє втручання за допомогою АВА-терапії впливає на соціальну інтеграцію та самостійність дітей з аутизмом?',
    content:
      'Дослідження показують, що раннє втручання через АВА-терапію може значно покращити якість життя дітей з аутизмом, допомагаючи їм інтегруватися в суспільство та стати більш самостійними.',
  },
  // {
  //   id: 3,
  //   title:
  //     'Я зможу щось зрозуміти з навчання, якщо моїх знань про вишивання зараз дуже мало?',
  //   content:
  //     'Однозначно! Міні-курс «Оливкова вишиванка» орієнтований на людей з мінімальним, або взагалі відсутнім досвідом. Тести на фокус-групі показали чудові результати серед учасників різних вікових категорій, статі та компетентності. Після проходження пʼяти уроків, з вишивкою розібрався кожен. Тож не сумнівайтеся, що у вас також вийде!',
  // },
  // {
  //   id: 4,
  //   title: 'Чи підійде це навчання дитині?',
  //   content:
  //     'Так! За умови нагляду дорослих. Навчальний процес буде цікавим та зрозумілим навіть для малечі. Проте оскільки вишивання повʼязане з роботою із гострими предметами, я рекомендую проходити його під наглядом дорослих. Разом веселіше та безпечніше! Оптимальний вік 12+ років',
  // },
  // {
  //   id: 5,
  //   title: 'Хочу придбати цей міні-курс у подарунок. Як це виглядатиме?',
  //   content: [
  //     'Чудово! Навички і знання - найкращий подарунок, бо вони залишаться назавжди з вами🤍 При настисканні кнопки «купити в подарунок», ви опинитесь на сторінці оплати. Вам потрібно буде ввести номер телефону та  імейл отримувача (якщо ви його знаєте).',
  //     <br key={`mockFreqQuestions__${9}`} />,
  //     <br key={`mockFreqQuestions__${10}`} />,
  //     'Після успішної оплати людина отримує лист на електронну пошту з посиланням, що надає доступ у наш телеграм бот з уроками. Одне натискання і все - можна починати вчитися. Якщо ви прикріпляли листівку, вона там теж буде!',
  //   ],
  // },
  // {
  //   id: 6,
  //   title:
  //     'Хочу придбати навчання у подарунок, проте не знаю імейлу людини, якій хочу зробити приємно.',
  //   content: [
  //     'Не біда, є інший шлях: ви пропускаєте графу з імейлом і проводите оплату. Після цього на екрані зʼявиться посилання, що веде у бот з навчанням. Вам потрібно буде скопіювати його НЕ ВІДКРИВАЮЧИ і самостійно переслати отримувачу.',
  //     <br key={`mockFreqQuestions__${1}`} />,
  //     <br key={`mockFreqQuestions__${2}`} />,
  //     'Важлива примітка: посилання активне лише на один перехід. Тож будьте уважні, якщо хочете дарувати курс. У разі, якщо лінк було активовано на вашому пристрої, в іншої людини він уже не працюватиме. Цей доступ лишиться у вас, а подарунок доведеться придбати знову.',
  //   ],
  // },
  // {
  //   id: 7,
  //   title:
  //     'Я купив навчання у подарунок, але випадково сам активував посилання. Що робити?',
  //   content: [
  //     'У разі придбання доступу до «Оливкової вишиванки» у якості подарунку, після оплати ви отримаєте повідомлення з посиланням, що надає доступ до навчання. Його потрібно переслати отримувачу не відкриваючи. ',
  //     <br key={`mockFreqQuestions__${3}`} />,
  //     <br key={`mockFreqQuestions__${4}`} />,
  //     'Оскільки лінк можливо активувати лише один раз, його не слід відкривати на своєму телефоні, якщо ви все ж плануєте дарувати курс. Бо в наступного користувача посилання просто не спрацює. ',
  //     <br key={`mockFreqQuestions__${5}`} />,
  //     <br key={`mockFreqQuestions__${6}`} />,
  //     'Якщо ж така халепа всеж сталася і ви запустили бот, вороття немає, курс тепер ваш. А подарунок потрібно буде придбати знову.',
  //     <br key={`mockFreqQuestions__${7}`} />,
  //     <br key={`mockFreqQuestions__${8}`} />,
  //     'Але спершу напишіть в тех підтримку @контакт, вони дадуть знижку, щоб вам не було так сумно робити покупку вдруге!',
  //   ],
  // },
  // {
  //   id: 8,
  //   title: 'На якій платформі проходить навчання?',
  //   content:
  //     'Після оплати ми запросимо вас перейти до Телеграм. А там уже чекає доброзичливий ОливкоБот. Його було спеціально створено з метою максимально спростити процес навчання. За вашою командою ОливкоБот неґайно видаватиме потрібні відео та додаткові матеріали. Без зайвих реєстрацій і зависаючих сайтів. Все під рукою в одному місці.',
  // },
];

export const FreqQuestion: FC<{ className?: string }> = ({ className }) => {
  const [expandedIds, setExpandedIds] = useState<number[]>(() => {
    const defaultExpandedId
      = mockFreqQuestions.length > 0 ? mockFreqQuestions[0]?.id : null;
    return defaultExpandedId ? [defaultExpandedId] : [];
  });

  const toggleAccordion = (accordionId: number) => {
    setExpandedIds((prevExpandedIds) => {
      if (prevExpandedIds.includes(accordionId)) {
        return prevExpandedIds;
      }
      return [...prevExpandedIds, accordionId];
    });
  };

  return (
    <section id="faq" className={cn('overflow-hidden', className)}>
      <div className="container flex flex-col gap-5 py-12">
        <h2 className="h2 text-text-tugrenya-black">Часті запитання</h2>
        <div data-content className="flex flex-col">
          {mockFreqQuestions.map(accordionItem => (
            <Accordion
              key={`Accordion_${accordionItem.id}`}
              item={accordionItem}
              isExpanded={expandedIds.includes(accordionItem.id)}
              toggleAccordion={toggleAccordion}
            />
          ))}
        </div>
      </div>
    </section>
  );
};
